IDEA StatiCa Open Model
SteelSetupIND Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The SteelSetupIND type exposes the following members.
Properties
Name | Description
GammaM0
 Partial safety factor for resistance governed by yielding
GammaM1
 Partial safety factor for resistance governed by ultimate stress
GammaMb
 Partial safety factor for bolts - bearing type
GammaMf
 Partial safety factor for bolts - friction type
GammaMw
 Partial safety factor for welds
Top
See Also
Reference
SteelSetupIND Class
IdeaRS.OpenModel Namespace